let handler = m => m
handler.all = async function (m) {
let chat = global.db.data.chats[m.chat] 
     if (/^استماره|011$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `اسـتـمـارة  الـدخـول 📃
❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

⇜🎎⎢ الـلـقـب  「」

⇜📽️⎢ الانـمـي  「」

⇜📸⎢ صـورة الـشـخـصـيـه ❗

⇜🙋🏻‍♂️🙋🏻‍♀️⎢ ولـد  / بنت   「」

⇜👥⎢ مـن طـرف  「」

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

✠ تــ✍︎ــوقــيــع ↯:
【 𝐀𝐙𝐊𝐀 𓆩☁️𓆪 𝐁𝐀𝐍  】`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
     if (/^ترحيب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `𝐖𝐞𝐥𝐜𝐨𝐦𝐞 𝐭𝐨 【 𝐀𝐙𝐊𝐀𝐁𝐀𝐍  ☁️】

┌═━═━═𓆩⛈️𓆪═━═━═┐

🎎⎢ الـلـقـب 『 』

📧⎢ الـمـنـشـن 『 』

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

أهـلا وسـهلاً بـك، نـحـن سـعـداء جـداً بـتـواجـدك مـعنـا، نـتـمـنى أن تـجـد مـا يـرضيـك و تـقـضي مـعـنا اجـمل و أمـتع الـأوقـات🤍🫶🏻.

❏ رابـط الاعـلانـات ↯:
〖 *https://chat.whatsapp.com/DeOaRFgZXoD74ow3PJ8L9s* 〗 
❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

✠ تــ✍︎ــوقــيــع ↯:
【 𝐀𝐙𝐊𝐀 𓆩☁️𓆪 𝐁𝐀𝐍  】`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
     if (/^ترقيه|ترقية$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `⎗ اعـلان【  تـرقـيـة 】🎐

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

مـن 👨🏻‍💼 ⎢ 〖 〗

الـى 👮🏻‍♂️ ⎢ 〖 〗

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

○ نـتـمـنـى مـنه ايـداء واجـبـه بـكـل اخـلاص، بـالـتـوفـيـق 🤍.

❆═━━━━═⌠⛈️⌡═━━━━═❆

✠ تــ✍︎ــوقــيــع ↯:
【 𝐀𝐙𝐊𝐀 𓆩☁️𓆪 𝐁𝐀𝐍  】`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
     if (/^اعفاء$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `⎗ اعـلان【  اعــفاء 】🎐

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

مـن 👮🏻‍♂️ ⎢ 〖 〗

الـى 👨🏻‍💼 ⎢ 〖 〗

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

⎗ نـتـأسـف و لـكـن انـت لـم تـؤدي واجـبـك بـشـكـل صـحـيـح ❕

❆═━━━━═⌠⛈️⌡═━━━━═❆

✠ تــ✍︎ــوقــيــع ↯:
【 𝐀𝐙𝐊𝐀 𓆩☁️𓆪 𝐁𝐀𝐍  】`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
     if (/^طرد مؤقت$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `【 طـــرد┃⭕┃مؤقت 】

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

الـلـقـب 🎎 ⎢  『 』

الـسـبـب ❓⎢  『 』

الـمـدة 📆 ⎢  『 』

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

✠ تــ✍︎ــوقــيــع ↯:
【 𝐀𝐙𝐊𝐀 𓆩☁️𓆪 𝐁𝐀𝐍  】`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
     if (/^اعلان انذار$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `【🕊️بطاقة┃⛔┃إنـــذار🕊️】 

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

الـلـقـب 🎎 ⎢  『 』

الـسـبـب ❓⎢  『 』

عـدد الانـذارات 🚨 ⎢  『 』

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

✠ تــ✍︎ــوقــيــع ↯:
【 𝐀𝐙𝐊𝐀 𓆩☁️𓆪 𝐁𝐀𝐍  】`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
     if (/^تغيير لقب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `⇦ اعـلان تـغـييـر لـقـب 🏮
❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

مـن 👤 ⎢〖 〗  

الـى 🎎 ⎢〖 〗 

الـمـنـشـن 📧 ⎢〖 〗 

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

✠ تــ✍︎ــوقــيــع ↯:
【 𝐀𝐙𝐊𝐀 𓆩☁️𓆪 𝐁𝐀𝐍  】`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
     if (/^فعالية القلوب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `⎗ فـعـالـيـة الـقـلوب ❤️

┌═━═━═𓆩⛈️𓆪═━═━═┐

الـشـرح ↯:
⇜يـملـك الـمـشـارك 4️⃣ قـلـوب، يـسـأل الـمـقدم سـؤال ( كـتابـه، صـور، عـكـس، الـخ...)، أول مـن يـجـاوب صـح يـخـتـار احـد الـمـشاركـيـن لـيـنقـص مـنه قـلـب، و من يـتـبـقـى الـى آخر الـفعاليـه و لم يـخـسر كل قـلوبـه؛ يكـون هـو الـفائـز 🎉


الـمـقـدم 👨🏻‍💻 ⎢ 【 】

وقـت الـفـعالـيـة ⏱️ ⎢ 【 】

مـكـان الـتـسـجيـل 📥 ⎢ 【 】

❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

✠ تــ✍︎ــوقــيــع ↯:
【 𝐀𝐙𝐊𝐀 𓆩☁️𓆪 𝐁𝐀𝐍  】`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
     if (/^فعالية القلوب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `⎗ فـعـالــية الـقلــوب ♥️

〖 اللقب 〗 

↤「」♥️♥️♥️♥️
↤「」❤️❤️❤️❤️
↤「」🧡🧡🧡🧡
↤「」💛💛💛💛
↤「」💚💚💚💚
↤「」🩵🩵🩵🩵
↤「」💙💙💙💙
↤「」💜💜💜💜`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
     if (/^فعالية القلوب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `╎ نتائج الفعالية ╎
❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

❍ الـمُـقَـدِّمْ🎙️╎『』
❍ الـجـائـزة 💰 ╎『』

❏ المركز الأول🥇『』
 • الجائزة💰╎

❏ المركز الثاني🥈『』
• الجائزة💰╎

❏ المركز الثالث🥉『』
• الجائزة💰╎

‏❅ ━ ── • ⛈️ • ── ━ ❅

⟐ بقية المشاركين 👥 :
• الجائزة💰╎10k

‏- 『』
‏- 『』
‏- 『』
‏- 『』
❆━━━━━═⏣⊰⛈️⊱⏣═━━━━━❆

✠ تــ✍︎ــوقــيــع ↯:
【 𝐀𝐙𝐊𝐀 𓆩☁️𓆪 𝐁𝐀𝐍  】`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}      if (/^نشر$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `لسه هاضفها`, m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
return !0 }
export default handler
